# Exploration

In [10]:
import pandas as pd

In [9]:
existing_customers = pd.read_excel('data/existing-customers.xlsx')

C:\Users\gta\PycharmProjects\data-mining\.venv\lib\site-packages\openpyxl\styles\stylesheet.py:226: UserWarning: Workbook contains no default style, apply openpyxl's default
  warn("Workbook contains no default style, apply openpyxl's default")

In [6]:
existing_customers.head()

,RowID,age,workclass,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,class
0,Row0,39,State-gov,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,Row1,50,Self-emp-not-inc,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,Row2,38,Private,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,Row3,53,Private,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,Row4,28,Private,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [7]:
existing_customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   RowID           32561 non-null  object
 1   age             32561 non-null  int64
 2   workclass       30725 non-null  object
 3   education       32561 non-null  object
 4   education-num   32561 non-null  int64
 5   marital-status  32561 non-null  object
 6   occupation      30718 non-null  object
 7   relationship    32561 non-null  object
 8   race            32561 non-null  object
 9   sex             32561 non-null  object
 10  capital-gain    32561 non-null  int64
 11  capital-loss    32561 non-null  int64
 12  hours-per-week  32561 non-null  int64
 13  native-country  31978 non-null  object
 14  class           32561 non-null  object
dtypes: int64(5), object(10)
memory usage: 3.7+ MB

In [8]:
existing_customers.describe()

                age  education-num  capital-gain  capital-loss  hours-per-week
count  32561.000000   32561.000000  32561.000000  32561.000000    32561.000000
mean      38.581647      10.080679   1077.648844     87.303830       40.437456
std       13.640433       2.572720   7385.292085    402.960219       12.347429
min       17.000000       1.000000      0.000000      0.000000        1.000000
25%       28.000000       9.000000      0.000000      0.000000       40.000000
50%       37.000000      10.000000      0.000000      0.000000       40.000000
75%       48.000000      12.000000      0.000000      0.000000       45.000000
max       90.000000      16.000000  99999.000000   4356.000000       99.000000

## Missing Values

- `pandas.DataFrame.fillna`
- `pandas.DataFrame.interpolate`
- `pandas.DataFrame.dropna`

`fillna` and `interpolate` do not make sense for attributes `workclass`, `occupation` and `native-coutnty`

In [12]:
existing_customers.isnull().sum()

RowID                0
age                  0
workclass         1836
education            0
education-num        0
marital-status       0
occupation        1843
relationship         0
race                 0
sex                  0
capital-gain         0
capital-loss         0
hours-per-week       0
native-country     583
class                0
dtype: int64

In [13]:
existing_customers.isnull().mean()

RowID             0.000000
age               0.000000
workclass         0.056386
education         0.000000
education-num     0.000000
marital-status    0.000000
occupation        0.056601
relationship      0.000000
race              0.000000
sex               0.000000
capital-gain      0.000000
capital-loss      0.000000
hours-per-week    0.000000
native-country    0.017905
class             0.000000
dtype: float64

In [14]:
clean_ec = existing_customers.dropna()

In [15]:
clean_ec.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 30162 entries, 0 to 32560
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   RowID           30162 non-null  object
 1   age             30162 non-null  int64
 2   workclass       30162 non-null  object
 3   education       30162 non-null  object
 4   education-num   30162 non-null  int64
 5   marital-status  30162 non-null  object
 6   occupation      30162 non-null  object
 7   relationship    30162 non-null  object
 8   race            30162 non-null  object
 9   sex             30162 non-null  object
 10  capital-gain    30162 non-null  int64
 11  capital-loss    30162 non-null  int64
 12  hours-per-week  30162 non-null  int64
 13  native-country  30162 non-null  object
 14  class           30162 non-null  object
dtypes: int64(5), object(10)
memory usage: 3.7+ MB

In [20]:
(len(existing_customers) - len(clean_ec)) / len(existing_customers)

0.07367709836921471

## Notes

capital-gain and capital-loss are mutually exclusive  
maybe combine them into one attribute?

by dropping the missing values, we lose $\approx$ 7.4% of the data  
is this acceptable?  
maybe handle the missing values in the classification algorithm itself?

## Inconsistent Values

- `education` and `education-num` are redundant attributes
- `marital-status` and `relationship` are partially redundant
- `relationship` and `sex` should be consistent

In [32]:
for index, row in clean_ec.iterrows():
    if row['relationship'] == 'Husband':
        if row['sex'] == 'Female':
            print(f'found a female husband at row {index}')
    elif row['relationship'] == 'Wife':
        if row['sex'] == 'Male':
            print(f'found a male wife at row {index}')

found a male wife at row 575
found a female husband at row 7109

In [35]:
clean_ec.loc[575]

RowID                         Row575
age                               29
workclass                    Private
education                  Bachelors
education-num                     13
marital-status    Married-civ-spouse
occupation           Exec-managerial
relationship                    Wife
race                           White
sex                             Male
capital-gain                       0
capital-loss                       0
hours-per-week                    40
native-country         United-States
class                           >50K
Name: 575, dtype: object

found inconsistencies in `relationship` and `sex`  
these are not correctable, could be either male or female  
but only 2, so leave as is

In [38]:
counts = {}
for index, row in clean_ec.iterrows():
    ed = row['education']
    ed_num = row['education-num']
    
    # Default actions
    if ed not in counts:
        counts[ed] = {}
    if ed_num not in counts[ed]:
        counts[ed][ed_num] = 0
        
    counts[ed][ed_num] += 1

counts

{'Bachelors': {13: 5044},
 'HS-grad': {9: 9840},
 '11th': {7: 1048},
 'Masters': {14: 1627},
 '9th': {5: 455},
 'Some-college': {10: 6678},
 'Assoc-acdm': {12: 1008},
 '7th-8th': {4: 557},
 'Doctorate': {16: 375},
 'Assoc-voc': {11: 1307},
 'Prof-school': {15: 542},
 '5th-6th': {3: 288},
 '10th': {6: 820},
 'Preschool': {1: 45},
 '12th': {8: 377},
 '1st-4th': {2: 151}}

`education` and `education-num` are consistent

## Duplicate Data

In [39]:
existing_customers[existing_customers.duplicated()]

Empty DataFrame
Columns: [RowID, age, workclass, education, education-num, marital-status, occupation, relationship, race, sex, capital-gain, capital-loss, hours-per-week, native-country, class]
Index: []

## Pairwise Correlation

TypeError: Series.corr() missing 1 required positional argument: 'other'

# Preprocessing


Additionally, if a categorical attribute has a large number of
values (categories), or some values occur infrequently, then it can be beneficial
for certain data mining tasks to reduce the number of categories by combining
some of the values.

## Normalization